app/controllers/answers_controller.rb

    def update
        @answers = Answers.find(params[:id])
        if @answers.update(answers_params)
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "answers" SET "is_true" = $1, "question_id" = $2 WHERE "answers"."id" = $3  [["is_true", 1], ["question_id", nil], ["id", 24]]

    def create
        @answers = Answers.create(answers_params)
        if @answers.save
---
INSERT INTO "answers" ("question_id", "is_true", "text") VALUES ($1, $2, $3) RETURNING "answer_id"  [["question_id", 2], ["is_true", 0], ["text", "222"]]
INSERT INTO "answers" ("is_true", "text") VALUES ($1, $2) RETURNING "answer_id"  [["is_true", 0], ["text", "2222"]]

    def edit
        @answers = Answers.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def destroy
        @answers = Answers.find(params[:id])
        @answers.destroy
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 26]]