app/controllers/game_controller.rb

  def set_answer
    if params[:set] == 'true'
      session_user_id = session[:"warden.user.user.key"][0][0].to_i
      old_game = Game.where(question_id: params[:question_id],game_id: params[:game_id])[0]
      if old_game.blank?
        object = Game.new(:game_id => params[:game_id], :question_id => params[:question_id], :answer_id => params[:answer_id], :user_id => session_user_id)
      else
        object = Game.update(old_game.id,:game_id => params[:game_id], :question_id => params[:question_id], :answer_id => params[:answer_id], :user_id => session_user_id)
      end
      object.save
    end
    @question = Questions.find_by_sql("SELECT id,text FROM questions WHERE id = " + params[:question_id] + " LIMIT 1;")
    @answers = Answers.where(question_id: params[:question_id])
    @right_answer = Answers.where(question_id: params[:question_id],is_true: 1)
---
SELECT "user_game".* FROM "user_game" LIMIT $1  [["LIMIT", 1]]
INSERT INTO "user_game" ("game_id", "question_id", "user_id", "answer_id") VALUES ($1, $2, $3, $4)  [["game_id", 22], ["question_id", 3], ["user_id", 1], ["answer_id", 8]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 4]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 AND "answers"."is_true" = $2  [["question_id", 3], ["is_true", 1]]