app/controllers/questions_controller.rb

    def index
        @questions = Questions.all
---
SELECT "questions".* FROM "questions"

    def update
        @questions = Questions.find(params[:id])
        if @questions.update(questions_params)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "score" = $1 WHERE "questions"."id" = $2  [["score", 7], ["id", 1]]

    def create
        @questions = Questions.new(questions_params)
        if @questions.save
---
INSERT INTO "questions" ("text", "score") VALUES ($1, $2) RETURNING "id"  [["text", "aaa"], ["score", 555]]

    def edit
        @questions = Questions.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def show
        @questions = Questions.find(params[:id])
        @answers = Answers.where(question_id: params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 2]]

    def destroy
        @questions = Questions.find(params[:id])
        @questions.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 8]]